export const ABOUT_TABS = [
  {
    title: "Наша місія",
    text: "У DinoTerra ми прагнемо розпалити цікавість і поглибити розуміння доісторичного минулого світу. Поєднуючи наукову точність із передовими технологіями, ми створюємо освітній простір для кожного.",
  },
  {
    title: "Чому ми?",
    text: "Залучайтеся до інтерактивних карт, 3D-моделей та динамічних шкал часу.\nОтримуйте доступ до детальних профілів видів та відкривайте захоплюючі історичні контексти.\nКонтент, створений для студентів, педагогів та ентузіастів.",
  },
  {
    title: "Особливості",
    text: "Дізнайтеся про динозаврів як ніколи раніше з детальними профілями видів та захоплюючою візуалізацією.\nПодорожуйте по карті, щоб досліджувати місця знахідок динозаврів у різних регіонах.\nСлідкуйте за хронологією динозаврів, від їх появи до вимирання.",
  },
  {
    title: "Наша історія",
    text: "DinoTerra народилася з любові до динозаврів і бажання поділитися цим захопленням зі світом. Те, що починалося як проста ідея, перетворилося на платформу, створену для того, щоб зробити вивчення динозаврів доступним, інтерактивним і цікавим для всіх.",
  },
] as const;
