import LinkToSourceComponent from "@/components/history/LinkToSourceComponent";
import ParaghraphsComponent from "@/components/history/ParaghraphsComponent";
import TitleComponent from "@/components/TitleComponent";
import React from "react";

const DinosaurExtinction = ({
  tabId,
  label,
}: {
  tabId: string;
  label: string;
}) => {
  return (
    <div id={tabId}>
      <TitleComponent
        text={label}
        size="md"
        textColor="black"
        additionalClasses="font-bold text-center"
      />
      <div className="flex flex-col gap-10">
        <div>
          <TitleComponent
            text="Крейдово-палеогенове вимирання"
            size="sm"
            textColor="fieryRed"
            additionalClasses="text-center"
          />
          <div className="text-center md:text-left flex flex-col gap-2">
            <div>
              <ParaghraphsComponent
                values={[
                  "Майже всі великі хребетні на Землі—на суші, в морі та в повітрі (всі динозаври, плезіозаври, мозазаври та птерозаври)—раптово вимерли приблизно 65 мільйонів років тому, наприкінці крейдового періоду. У той же час більшість планктону та багато тропічних безхребетних, особливо рифові мешканці, також зникли, а багато наземних рослин зазнали серйозних втрат. Ця подія знаменує собою важливу межу в історії Землі—К-Т межу (Крейдово-Третинну) і кінець мезозойської ери.",
                  "К-Т вимирання було глобальним, охопивши всі основні континенти та океани. Досі точаться дискусії щодо того, наскільки коротким був цей період. У геологічному масштабі часу це сталося дуже раптово і могло бути катастрофічним за будь-якими мірками.",
                  "Попри масштаби вимирання, не варто вважати К-Т межу суцільною катастрофою для всього живого. Більшість груп організмів вижили. Комахи, ссавці, птахи та квіткові рослини на суші, а також риби, корали та молюски в океані продовжили існування та швидко розвинулися після завершення крейдового періоду.",
                  "Серед жертв К-Т катастрофи були не лише великі тварини того часу, але й деякі з найдрібніших організмів, зокрема планктон, який забезпечував основну первинну продукцію в океанах.",
                ]}
              />
              <LinkToSourceComponent
                link="https://ucmp.berkeley.edu/education/events/cowen1b.html"
                text="Взято з University of California, Berkeley"
              />
            </div>
          </div>
        </div>
        <div>
          <TitleComponent
            text="Теорія про астероїд"
            size="sm"
            textColor="fieryRed"
            additionalClasses="text-center"
          />
          <div className="text-center md:text-left flex flex-col gap-2">
            <div>
              <ParaghraphsComponent
                values={[
                  "Крейдяно-палеогенове вимирання є найновішим масовим вимиранням і єдиним, яке однозначно пов’язане з ударом великого астероїда. Близько 76% усіх видів на планеті, включаючи всіх непташиних динозаврів, зникли.",
                  "Приблизно 66 мільйонів років тому астероїд діаметром близько 12 кілометрів врізався у води поблизу сучасного півострова Юкатан у Мексиці зі швидкістю 72 000 км/год. Величезний удар, що залишив кратер понад 180 кілометрів у ширину, викинув величезні обсяги пилу, уламків і сірки в атмосферу, спричинивши різке глобальне похолодання. Лісові пожежі спалахнули на всій території радіусом 1500 кілометрів від місця удару, а гігантське цунамі поширилося по всій планеті. Всього за одну ніч екосистеми, що підтримували існування динозаврів, почали руйнуватися. (Дізнайтеся більше про останній день панування динозаврів.)",
                  "Глобальне потепління, спричинене вулканічними виверженнями на Деканських трапах в Індії, могло ще більше погіршити ситуацію. Деякі вчені навіть припускають, що частина вивержень Деканських трап могла бути спричинена саме цим астероїдним ударом.",
                ]}
              />
              <LinkToSourceComponent
                link="https://www.nationalgeographic.com/science/article/mass-extinction"
                text="Взято з National Geographic"
              />
            </div>
            <div>
              <ParaghraphsComponent
                values={[
                  "Метеорит, достатньо великий, щоб називатися малим астероїдом, ударив Землю саме в момент K-T вимирання. Докази цього удару вперше виявили Вальтер Альварес та його колеги. Вони з’ясували, що породи, відкладені точно на межі K-T, містять надзвичайно велику кількість металу іридію (Рис. 18.1). Це справедливо як для порід, що сформувалися на суші, так і для тих, що відклалися під водою. В Тихому океані та Карибському морі глина з іридієм утворює шар в осадових відкладеннях на дні океану; вона також знайдена у континентальних шельфових відкладеннях Європи та в Північній Америці — від Канади до Нью-Мексико, де вона присутня в вугільних пластах на рівнинах і дельтах. Датування є точним, і шар іридію ідентифіковано в більш ніж 100 місцях по всьому світу. У морських осадових породах іридій міститься у шарі безпосередньо над останніми крейдовими мікрофосиліями, а вище нього зустрічаються палеоценові мікрофосилії з найдавніших відкладень кайнозою.",
                  "Іридій присутній лише в породах на межі K-T, тому він був відкладений у вигляді єдиного великого стрибка: дуже короткої події. У нормальних морських осадових породах іридій зустрічається у мікроскопічних кількостях, проте його вміст у межовому шарі K-T дуже високий. Іридій рідкісний на Землі, і хоча він може накопичуватися через хімічні процеси в осаді, такий різкий сплеск його концентрації повинен мати незвичайне походження. Іридій зустрічається значно рідше за золото на Землі, проте в K-T глиняному шарі він зазвичай удвічі перевищує вміст золота, а іноді навіть більше. Така ж висока концентрація іридію характерна для метеоритів. Група Альвареса припустила, що іридій розповсюдився по всьому світу хмарою уламків, що утворилася внаслідок удару астероїда об Землю.",
                  "Астероїд, достатньо великий, щоб пояснити глобальне поширення іридію в K-T шарі, міг мати близько 10 км у діаметрі. Комп’ютерні моделі показують, що при зіткненні з Землею такий астероїд би пройшов крізь атмосферу і океан, ніби їх не існувало, і пробив би кратер діаметром близько 100 км. Іридій і найдрібніші уламки розповсюдилися б по всьому світу ударною хвилею, коли астероїд перетворився у вогненну кулю. Якщо дійсно цей сплеск був викликаний великим ударом, які ще докази можна знайти у геологічних породах?",
                  "Добре відомі ударні кратери часто містять уламки ударного кварцу та сферули (маленькі скляні сфери), пов’язані з ними. Скло утворюється, коли порода-мішень плавиться під час удару, викидається в повітря у вигляді крапель і майже миттєво застигає. З часом ці сферули можуть розкладатися і перетворюватися на глину. Ударний кварц формується, коли кристали кварцу зазнають раптового імпульсу високого тиску. Якщо температура недостатня для плавлення, вони можуть зберігати особливі та впізнавані мікроструктури.",
                  "По всій Північній Америці в K-T глиняному шарі містяться скляні сферули, а безпосередньо над цим шаром знаходиться ще тонший шар, що містить іридій та уламки ударного кварцу. Він має лише кілька міліметрів товщини, але загалом містить більше ніж один кубічний кілометр ударного кварцу лише в Північній Америці. Зона ударного кварцу простягається на захід до дна Тихого океану, але в інших регіонах світу він рідкісний. Вся ця інформація свідчить про те, що удар стався на території або поблизу Північної Америки: іридій походить з випаруваного астероїда, а ударний кварц — з континентальних порід, у які він врізався.",
                  "Кратер K-T удару тепер знайдено. Це приблизно овальна геологічна структура під назвою Чикшулуб, глибоко похована під осадами півострова Юкатан у Мексиці. Структура має діаметр близько 180 км, що робить її одним із найбільших ударних кратерів, достовірно ідентифікованих на Землі.",
                  "Свердловина, пробурена в Чикшулубі, виявила 380 метрів (понад 1000 футів) магматичних порід з незвичайною хімією. Ця хімія могла виникнути внаслідок плавлення суміші осадових порід цього регіону. Магматичні породи під Чикшулубом містять високі рівні іридію, і їхній вік становить 65 млн років, що точно збігається з межею K-T.",
                  "Над магматичною породою знаходиться маса уламкових порід, ймовірно, найбільших залишків, що впали назад у кратер, не розплавившись. А над ними знаходяться нормальні осадові відкладення, що повільно заповнювали кратер у неглибоких тропічних морях, які покривали область удару.",
                  "Відомі ударні кратери часто містять текти́ти — більші скляні кульки з незвичайними формами та поверхнями. Вони утворюються, коли породи миттєво плавляться і викидаються з місця удару у вигляді розплавлених бризок, а потім охолоджуються під час обертання в повітрі.",
                  "Гаїті було приблизно за 800 км від Чикшулуба наприкінці Крейдового періоду. У місцевостях Белок та інших на Гаїті межа K-T позначена нормальним, але товстим (30 см) глиняним шаром, що складається переважно зі скляних сферул. Глина перекрита шаром турбідітів — підводних зсувних відкладень, що містять великі уламки порід. Деякі з них виглядають як фрагменти океанічної кори, але також містять сферичні шматки жовтого і чорного скла до 8 мм у діаметрі — справжні текти́ти.",
                  "Чикшулубський удар викликав цунамі, що розповсюдило уламки, і викид пилу та іридію, який осів по всьому світу. Ударний кут (~20-30°) сприяв розповсюдженню уламків на північний захід, що пояснює особливі руйнування в Північній Америці",
                  "Таким чином, удар Чикшулуба спричинив не лише масове вимирання, але й глобальні катастрофічні наслідки, що змінили історію Землі назавжди.",
                ]}
              />
              <LinkToSourceComponent
                link="https://ucmp.berkeley.edu/education/events/cowen1b.html"
                text="Взято з University of California, Berkeley"
              />
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default DinosaurExtinction;
