import LinkToSourceComponent from "@/components/history/LinkToSourceComponent";
import ParaghraphsComponent from "@/components/history/ParaghraphsComponent";
import TitleComponent from "@/components/TitleComponent";

const DinosaursOrigin = ({
  tabId,
  label,
}: {
  tabId: string;
  label: string;
}) => {
  return (
    <div id={tabId}>
      <TitleComponent
        text={label}
        size="md"
        textColor="black"
        additionalClasses="font-bold text-center"
      />
      <div className="flex flex-col gap-10">
        <div>
          <TitleComponent
            text="Час появи"
            size="sm"
            textColor="fieryRed"
            additionalClasses="text-center"
          />
          <div className="text-center md:text-left flex flex-col gap-2">
            <div>
              <ParaghraphsComponent
                values={[
                  "Одне відомо точно: динозаври з’явилися в тріасовий період, між 252 та 201 мільйонами років тому. Майже в усьому іншому ми не впевнені. Наприклад, коли саме вони з’явилися, у ранньому чи пізньому тріасі? Яким був світ, коли вони вийшли на сцену? Чи проторували вони шлях до панування в глобальній екосистемі відчайдушною боротьбою з іншими тваринами або ж їм просто пощастило посісти своє місце?",
                ]}
              />
              <LinkToSourceComponent
                link="https://nashformat.ua/pdf-preview/dynozavry.-novyj-poglyad-941430"
                text="Взято з NashFormat"
              />
            </div>
            <div>
              <ParaghraphsComponent
                values={[
                  "Динозаври виникли з маленьких динозавроморфних предків у тріасовому періоді, коли клімат був суворим і сухим. Вони змагалися з архозаврами-крокодилами протягом десятків мільйонів років, але зрештою перемогли, коли Пангея почала розколюватися, — повідомив Брюсетті. У цей час вулкани вивергалися вздовж тріщин суперконтиненту, викликаючи глобальне потепління і масове вимирання, сказав він.",
                ]}
              />
              <LinkToSourceComponent
                link="https://www.livescience.com/3945-history-dinosaurs.html"
                text="Взято з livescience"
              />
            </div>
          </div>
        </div>

        <div>
          <TitleComponent
            text="Еволюційні корені"
            size="sm"
            textColor="fieryRed"
            additionalClasses="text-center"
          />
          <div className="text-center md:text-left flex flex-col gap-2">
            <div>
              <ParaghraphsComponent
                values={[
                  "Динозаври протягом довгого часу домінували на суші, створюючи різноманітні форми: від травоїдних гігантів, таких як Аргентинозавр, до м'ясоїдних хижаків, таких як Тиранозавр, і незвичних істот, таких як Теризинозавр, з його кігтями, що нагадують claws Фредді Крюгера. Але походження динозаврів — коли і де вони з’явилися вперше — залишається частково загадкою.",
                  "Дослідники тепер пропонують несподівану локацію для батьківщини динозаврів, ґрунтуючись на місцезнаходженнях найстаріших відомих скам'янілостей динозаврів, еволюційних зв'язках між цими ранніми формами та географії Землі під час Тріасового періоду. Це місце охоплює сучасні Сахару та Амазонські джунглі, які зараз розділені тисячами миль і океаном через геологічний процес, відомий як плиткова тектоника.",
                  "''Коли динозаври вперше з'являються у викопному літописі, всі континенти Землі були частиною гігантського суперконтиненту Пангея. Динозаври виникли в південній частині цієї земної маси, відомої як Гондвана,'' сказав Джоел Гіт, аспірант палеонтології в Університетському коледжі Лондона та Лондонському музеї природної історії",
                  "Наші дослідження вказують, що вони ймовірно виникли в низьких широтах Гондвани поблизу екватора, на території, що сьогодні охоплює північну Південну Америку та північну Африку, додав Гіт",
                  "Найдавніші відомі скам'янілості динозаврів датуються приблизно 230 мільйонами років тому, серед яких Еораптор та Герреразавр з Аргентини, Сатурналія з південного Бразилії та Мбіразавр з Зімбабве. Хоча вони мали певні риси, що визначають їх як динозаврів, існували достатні відмінності, що свідчить про еволюцію динозаврів протягом мільйонів років.",
                  "''Хоча раніше дослідження зосереджувалися на південному Південному заході Америки та південному Африці як на місцях виникнення динозаврів, ми припускаємо, що значні прогалини в скам'янілостях, особливо в районах, що сьогодні включають Сахару та Амазонку, можуть зберігати потенціал для розкриття місця, де найраніші динозаври жили'', зазначив Гіт.",
                  "Динозаври ймовірно з'явилися близько 245-230 мільйонів років тому, коли ці екваторіальні регіони були надзвичайно спекотними і сухими. Це, ймовірно, включало пустелі, саваноподібні місця та, можливо, лісисті території, схильні до сезонних лісових пожеж. Раніше вважалося, що динозаври відсутні в таких суворих умовах.",
                  "Динозаври еволюціонували з більш примітивних рептилій після найбільшого масового вимирання на Землі, спричиненого екстремальним вулканізмом на кінці Пермського періоду близько 252 мільйони років тому.",
                  "Динозаври є унікальними через певні риси їхнього скелета. Вони стояли прямо, з ногами, що знаходились під тілами, як стовпи, що допомагало їм ефективно рухатися і бігати. Вони також мали особливі стегна, що відрізняли їх від інших рептилій, у яких ноги були широко розставлені.",
                  "Ці спеціалізовані риси не з’явилися миттєво, вони еволюціонували поступово протягом мільйонів років від старіших, більш примітивних рептилій. Однак ми ще не знайшли перехідних скам'янілостей, що показали б, як ці зміни сталися, залишаючи частину їх еволюційної історії невідомою.",
                ]}
              />

              <LinkToSourceComponent
                link="https://www.reuters.com/science/where-did-dinosaurs-first-evolve-scientists-have-an-answer-2025-01-23/"
                text="Взято з reuters"
              />
            </div>
          </div>
        </div>
        <div>
          <TitleComponent
            text="Перші предки"
            size="sm"
            textColor="fieryRed"
            additionalClasses="text-center"
          />
          <div className="text-center md:text-left flex flex-col gap-2">
            <div>
              <ParaghraphsComponent
                values={[
                  "Динозаври – одна з найуспішніших груп тварин, які коли-небудь населяли нашу планету.",
                  "Протягом понад 170 мільйонів років вони домінували на суші – від невеликих створінь завдовжки лише кілька футів до одних із найбільших тварин, що коли-небудь ходили по Землі.",
                  "Однак, незважаючи на їхню довгу еволюційну історію, походження динозаврів залишається загадкою. Коли ж вони з’явилися і як виглядали перші представники цієї групи?",
                  "Найдавніший відомий динозавр – це не одна окрема тварина, а ціла екосистема, що містить кілька різних видів. Не існує універсально визнаного виду динозавра, який був би найстарішим.",
                  "Відкладення формації Іскігуаласто в Аргентині, датовані приблизно 230 мільйонами років тому (пізній Тріасовий період), містять рештки різних тварин. Вони показують, що середовище було заселене ранніми рептиліями, відомими як рінхозаври, а також представниками групи, близької до предків ссавців – цінодонтами.",
                  "Проте найважливіше те, що в цій екосистемі також присутні кілька видів ранніх динозаврів. Серед них були невеликі двоногі істоти, такі як Еодромеус і Еораптор, а також крупніші хижаки, такі як Герреразавр.",
                  "Професор Пол Барретт — дослідник динозаврів у Музеї, який вивчає ранню еволюцію динозаврів у пізньому Тріасовому та ранньому Юрському періодах.",
                  "''Є кілька місць в Аргентині та Бразилії, які змагаються за титул батьківщини найдавніших точно відомих динозаврів'', — каже Пол. ''Але коли вони з'явилися, вони вже були впізнаваними динозаврами. Це свідчить про те, що динозаври повинні були мати довшу еволюційну історію, якої ми ще не знаємо, і існує певна дискусія щодо того, скільки цієї еволюційної історії наразі відсутнє''",
                  "Динозаври належать до групи тварин, відомої як архозаври",
                  "Сьогодні ця група представлена птахами та крокодилами (деякі вчені також включають черепах до цієї групи). У минулому вона була набагато різноманітнішою, оскільки включала всі вимерлі динозаври, птерозаврів та багато дивних предків крокодилів.",
                  "''Є кілька різних ознак, які визначають динозавра, але, мабуть, найяскравішими є зміни в їхніх стегнах і ногах'', — пояснює Пол.",
                  "''Зокрема, вони створюють набагато міцніше з'єднання між стегнами та хребтом, перетворюючи деякі свої хребці на спеціальну модифіковану структуру, звану сакрумом, яка створює ці додаткові з'єднання з стегнами.''",
                  "У рептилій є до двох з'єднаних хребців у сакрумі, але для того, щоб бути динозавром, тварина має мати принаймні три. У сучасних птахів може бути до 12 сакральних хребців.",
                  "Ця особливість настільки характерна, що сер Річард Оуен, засновник Музею, використовував її, коли вперше визначав Dinosauria в 1842 році, помітивши, що вимерлі тварини Ігуанодон і Мегалозавр мали сакрум, складений з п'яти з'єднаних хребців.",
                  "Ці зміни, ймовірно, стали результатом того, що перші динозаври почали ходити на задніх лапах, тобто були двоногими.",
                  "''Двоногість дійсно важлива для визначення ранніх динозаврів'', — каже Пол. ''Щоб це зробити, їм також потрібно було модифікувати свої задні ноги.''",
                  "У той час як крокодили та ящірки мають ноги, що виступають із тіла під кутом, динозаври повинні були притискати їх прямо під тіло, щоб стати двоногими. Це означає, що їм довелося змінити з'єднання стегон і хребта, верхні частини стегнових кісток, де кістки з'єднуються з тазом, а також суглоби в колінах і щиколотках.",
                  "Всі ці особливості разом допомагають визначити динозавра.",
                  "Якщо динозаври, знайдені в Ішігваласто, вже є впізнаваними динозаврами, це свідчить про те, що їхнє походження ще більш давнє.",
                  "Найближчими родичами динозаврів є сілезаври — середнього розміру чотириногі тварини, що виглядали як високі, стрункі ящірки, і розташовуються на межі з Dinosauria.",
                  "''Але є цей 10-15 мільйонний проміжок часу, який відокремлює спільного предка сілезаврів і динозаврів від перших справжніх динозаврів'', — каже Пол.",
                  "Що заповнює цей проміжок, досі невідомо, але можливо це включає часткову скам'янілість тварини Nyasasaurus parringtoni, що була знайдена в Танзанії, біля озера Ньяса, в 1930-х роках.",
                  "У зв'язку з фрагментарністю цього викопного, важко точно сказати, чи це був справжній динозавр. У будь-якому разі, вважається, що це дуже близький родич динозаврів.",
                  "''Nyasasaurus — це єдина тварина, яка була попередньо поміщена в цей проміжок, оскільки вона має той самий вік, що й перші сілезаври'', — пояснює Пол. ''Тож це може означати, що це найраніший динозавр, або це може бути найближчий родич динозаврів, який був знайдений.''",
                  "Незалежно від статусу Nyasasaurus, досить чітку картину того, як виглядали перші динозаври, можна скласти, спираючись на дані, отримані від найдавніших справжніх динозаврів.",
                  "Ймовірно, вони були невеликими, активними хижаками. Починаючи з довжини тіла лише кілька метрів, вони були двоногими з маленькими, захоплюючими лапами.",
                  "''Ймовірно, що вони були або м'ясоїдами, або всеїдними, але вони точно не були травоїдними'', — каже Пол. ''Вони були відносно рідкісними, оскільки навіть коли з'явилися перші визначені динозаври близько 230 мільйонів років тому, вони ще були рідкісними членами фауни.''",
                  "Лише після великої вимирання в кінці Тріасового періоду, що сталося 201 мільйон років тому, динозаври нарешті отримали свій шанс.",
                  "Ця масова вимирання знищила майже всіх інших архозаврів-конкурентів, залишивши середовище, яке було широко відкритим для заповнення динозаврами. Протягом Юрського і Крейдового періодів динозаври скористалися цією можливістю, еволюціонуючи в неймовірну різноманітність створінь.",
                ]}
              />
              <LinkToSourceComponent
                link="https://www.nhm.ac.uk/discover/where-did-dinosaurs-come-from.html"
                text="Взято з NHM"
              />
            </div>
          </div>
        </div>
        <div>
          <TitleComponent
            text="Розвиток базових пристосувань"
            size="sm"
            textColor="fieryRed"
            additionalClasses="text-center"
          />
          <div className="text-center md:text-left flex flex-col gap-2">
            <div>
              <ParaghraphsComponent
                values={[
                  "Фізичні адаптації динозаврів були різноманітні й часто пов'язані з їхнім розміром, харчуванням та середовищем існування. Вражаючі роги і валки у Triceratops, наприклад, ймовірно використовувалися для захисту та, можливо, для залучення партнерів. Масивні щелепи і зуби з зазубринами у Tyrannosaurus rex були адаптаціями для кусання і поїдання великої здобичі. Ці фізичні риси еволюціонували для покращення здатностей динозаврів до харчування, самозахисту та розмноження.",
                  "Ще один вражаючий приклад фізичної адаптації – розвиток пір'я у деяких тероподних динозаврів, що є характеристикою, яка збереглася у їхніх сучасних нащадках – птахах. Пір'я могло спочатку еволюціонувати для ізоляції або для демонстрації і тільки пізніше стати адаптацією для польоту.",
                  "Поведінкові адаптації – це дії, які динозаври здійснювали для виживання в своєму середовищі. Докази свідчать, що деякі динозаври, як-от Velociraptor, могли полювати зграями, що є поведінковою адаптацією, яка збільшує шанси на успіх при полюванні на більшу здобич. Поведінка з гніздування і насиджування, як це видно в скам'янілих рештках Maiasaura, свідчить про те, що деякі динозаври надавали батьківський догляд своїм дитинчатам, що підвищувало шанси на виживання нащадків.",
                  "Соціальна поведінка – ще один аспект поведінкових адаптацій. Динозаври, такі як Stegosaurus, могли жити зграйно як захист від хижаків. Таке соціальне життя також могло сприяти можливостям для парування і забезпечувати спільний догляд за молодими.",
                  "Дієтичні адаптації динозаврів тісно пов'язані з наявністю джерел їжі в їхньому середовищі. Травоїдні динозаври, такі як довгошийні сауроподи, розвинули спеціалізовані зуби для здирання листя та перероблення рослинного матеріалу. Хижі динозаври, з іншого боку, мали гострі зуби для розривання м'яса. Деякі динозаври, як-от Oviraptor, можливо мали різноманітну дієту, про що свідчить їхній дзьобоподібний рот, що дозволяв розколювати тверді черепашки або захоплювати м'якіші рослини.",
                  "Репродуктивні адаптації, мабуть, є одними з найважливіших для продовження виду. Динозаври демонстрували широкий спектр репродуктивних стратегій, від відкладання великих кладок яєць до ймовірного будівництва складних гнізд. Форма та розмір яєць динозаврів, а також структура гнізд, варіювали серед видів і були адаптовані до специфічних умов середовища, в якому динозаври жили.",
                  "Деякі тероподи, як-от Troodon, ймовірно, мали особливо складні репродуктивні поведінки, включаючи насиджування яєць у ретельно побудованих гніздах. Ці поведінки допомагали забезпечити оптимальну температуру для розвитку яєць.",
                ]}
              />

              <LinkToSourceComponent
                link="https://www.reuters.com/science/where-did-dinosaurs-first-evolve-scientists-have-an-answer-2025-01-23/"
                text="Взято з reuters"
              />
            </div>
          </div>
        </div>
        <div>
          <TitleComponent
            text="Перші справжні динозаври"
            size="sm"
            textColor="fieryRed"
            additionalClasses="text-center"
          />
          <div className="text-center md:text-left flex flex-col gap-2">
            <div>
              <ParaghraphsComponent
                values={[
                  "Протягом останніх двадцяти років Еораптор вважався початком ери динозаврів. Ця суперечлива маленька істота, знайдена в приблизно 231 мільйон років старій породі Аргентини, часто цитувалася як найдавніший відомий динозавр. Але Еораптор, ймовірно, більше не має цього титулу, або скоро його позбавлять. Новознайдений скам’янілий залишок, знайдений ще десятки років тому в Танзанії, відсуває початок ери динозаврів на більше ніж 10 мільйонів років назад.",
                  "Названий Nyasasaurus parringtoni, скам’янілості віком приблизно 243 мільйони років представляють або найстаріших відомих динозаврів, або найближчого відомого родича перших динозаврів. Це відкриття було оголошено палеонтологом з Університету Вашингтона Стірлінгом Несбітом і його колегами в журналі Biology Letters. Окрім того, що відкриття є визнанням роботи Алана Чаріга, який вивчав та назвав тварину, але ніколи не опублікував офіційного опису, це також є важливим внеском у розуміння походження динозаврів. Визнання Nyasasaurus як частини початкового розвитку родини динозаврів додає до зростаючого числа доказів того, що предки динозаврів почали розвиватися після масового вимирання.",
                  "У березні 2010 року Несбіт і його команда назвали іншу істоту з того ж тріасового шару в Танзанії Asilisaurus kongwe. Ця тварина була динозавроморфом, членом групи, з якої вийшли перші справжні динозаври. Знахідка вказує на те, що лінія динозаврів могла розділитися з загальним предком вже в той час, тобто найархаїчніші динозаври могли існувати вже 243 мільйони років тому.",
                  "Nyasasaurus є ще одним кроком до перших справжніх динозаврів і таким же старим, як Asilisaurus. Знайдення тварини з такими відмінними, динозавроподібними рисами в середньому тріасовому періоді свідчить про те, що динозаври вже існували, або їхні предки вже були встановлені. Однак, хоча наші знання про Nyasasaurus обмежені — це тварина представлена тільки правим плечовим кістками та декількома хребцями — ця динозавроморфа відзначає додаткові 12 мільйонів років історії динозаврів, яку палеонтологи лише починають досліджувати.",
                  "Незважаючи на те, що скам’янілості Nyasasaurus неповні, цей організм є важливим кроком до розуміння, якими були перші динозаври. Знайдення таких істот у середньому тріасовому періоді показує, що динозаври або їхні предки вже існували, або їх родова лінія тільки почала формуватися. На думку палеонтологів, відображенням цього періоду є те, що динозаври в той час ще не домінували у своїх екосистемах — вони були невеликими, скромними тваринами, які жили у світі, в якому правили архозаври, тісніше пов’язані з крокодилами.",
                ]}
              />

              <LinkToSourceComponent
                link="https://www.smithsonianmag.com/science-nature/scientists-discover-oldest-known-dinosaur-152807497/#:~:text=Named%20Nyasasaurus%20parringtoni%2C%20the%20roughly,relative%20to%20the%20earliest%20dinosaurs."
                text="Взято з Smithsonian"
              />
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};

export default DinosaursOrigin;
